Конвертация_данных_31_демо.Conversion_3_Plus/src/Catalogs/Конвертации/Конвертации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e18d9381-4a28-46d8-a92d-755ca9a89e17">
  <name>Конвертации</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ab625cb8-9910-471e-bc05-af745239a524">
    <name>АлгоритмПередКонвертацией</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cec9f551-422e-49b6-9aaf-78d152e0f2b4">
    <name>АлгоритмПослеКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7f373551-bb85-4df7-a32c-be8e291d677a">
    <name>АлгоритмПередОтложеннымЗаполнением</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="556f7b1b-7ec2-419c-929a-e59038bc17c2">
    <name>Параметры</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c0eb5fda-ed27-4366-9c8b-06c9508127ec">
      <name>Параметр</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конвертация_данных_31_демо.Conversion_3_Plus/src/Catalogs/Конвертации/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Если КонвертацияXDTO Тогда
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "ПередКонвертацией";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПередКонвертацией, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "ПередОтложеннымЗаполнением";
		Опции.АвтоНаправление = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение();
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПередОтложеннымЗаполнением, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "ПослеКонвертации";
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПослеКонвертации, Опции);
		
		Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
		Опции.ИмяСтраницы = "ПередОбработкойУдаления";
		Опции.АвтоНаправление = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение();
		Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.АлгоритмПередОбработкойУдаления, Опции);
		
		Расш1_КонсольКода.СоздатьХостКонсоли(
			ЭтотОбъект, Элементы.СтраницаОбработчики, "СтраницыОбработчики", Неопределено, Истина);
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Конвертация", "СправочникСсылка.Конвертации");
		ЭтотОбъект["Конвертация"] = Объект.Ссылка;
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Направление", "Строка");
		
		Элементы.Страницы.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_СтраницыПриСменеСтраницы");
		Элементы.ГруппаДанныеКонвертацииXDTO.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_ГруппаДанныеКонвертацииXDTOПриСменеСтраницы");
		Элементы.СтраницыОбработчики.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_СтраницыОбработчикиПриСменеСтраницы");
		УстановитьДействие("ОбработкаОповещения", "Расш1_Подключаемый_ОбработкаОповещения");
		
	Иначе
		
		Отправка = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыОтправка();
		Получение = Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение();
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПослеЗагрузкиПравилОбмена, "ПослеЗагрузкиПравилОбмена", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПередВыгрузкойДанных, "ПередВыгрузкойДанных", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(
			Элементы.АлгоритмПередПолучениемИзмененныхОбъектов, "ПередПолучениемИзмененных", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПередВыгрузкойОбъекта, "ПередВыгрузкойОбъекта", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(
			Элементы.АлгоритмПередОтправкойИнформацииОбУдалении, "ПередОтправкойУдаления", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПередКонвертациейОбъекта, "ПередКонвертациейОбъекта", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПослеВыгрузкиОбъекта, "ПослеВыгрузкиОбъекта", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПослеВыгрузкиДанных, "ПослеВыгрузкиДанных", Отправка);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПередЗагрузкойДанных, "ПередЗагрузкойДанных", Получение);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПослеЗагрузкиПараметров, "ПослеЗагрузкиПараметров", Получение);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(
			Элементы.АлгоритмПослеПолученияИнформацииОбУзлахОбмена, "ПослеПолученияУзловОбмена", Получение);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПередЗагрузкойОбъекта, "ПередЗагрузкойОбъекта", Получение);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(
			Элементы.АлгоритмПриПолученииИнформацииОбУдалении, "ПриПолученииУдаления", Получение);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПослеЗагрузкиОбъекта, "ПослеЗагрузкиОбъекта", Получение);
		Расш1_ЗарегистрироватьАлгоритмСтраницы(Элементы.АлгоритмПослеЗагрузкиДанных, "ПослеЗагрузкиДанных", Получение);
		
		Расш1_КонсольКода.СоздатьХостКонсоли(
			ЭтотОбъект, Элементы.СтраницаКонвертацияXML, "ОбработчикиXML", Неопределено, Истина);
		
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Конвертация", "СправочникСсылка.Конвертации");
		ЭтотОбъект["Конвертация"] = Объект.Ссылка;
		Расш1_КонсольКода.СоздатьРеквизит(ЭтотОбъект, "Направление", "Строка");
		
		Элементы.Страницы.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_СтраницыПриСменеСтраницы");
		Элементы.ОбработчикиXML.УстановитьДействие(
			"ПриСменеСтраницы", "Расш1_Подключаемый_ОбработчикиXMLПриСменеСтраницы");
		УстановитьДействие("ОбработкаОповещения", "Расш1_Подключаемый_ОбработкаОповещения");
		
	КонецЕсли;
	
	Расш1_КонсольКода.ЗаполнитьРеквизитыПоиска(
		ЭтотОбъект,
		Параметры.Расш1_ФразаПоиска,
		Параметры.Расш1_ИмяПоляПоиска,
		Параметры.Расш1_НомерСтрокиПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПриОткрытииПосле(Отказ)
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_НазначитьКонсольТекущейСтраницы();
	Расш1_КонсольКодаКлиент.ПерейтиКВхождению(ЭтотОбъект);
	Расш1_КонсольКодаКлиент.ПроверитьОписаниеМетаданныхПриОткрытии(ЭтотОбъект["Конвертация"]);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Расш1_КонсольКодаКлиент.ОбработкаОповещенияНастроек(ЭтотОбъект, ИмяСобытия);
	Если ИмяСобытия = Расш1_КонсольКодаКлиентСервер.ИмяСобытияПереходаКВхождению() Тогда
		Расш1_КонсольКодаКлиент.ЗаписатьПараметрыПоискаИзОповещения(ЭтотОбъект, Параметр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ЗаписатьТекстыКонсолейВОбъект(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаКонвертацияXDTO"
		И Элементы.ГруппаДанныеКонвертацииXDTO.ТекущаяСтраница.Имя = "СтраницаОбработчики" Тогда
		ПослеФормированияКонсолей("ПередКонвертацией");
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаКонвертацияXML" Тогда
		ПослеФормированияКонсолей(Элементы.ОбработчикиXML.ТекущаяСтраница.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_ОбработчикиXMLПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ПослеФормированияКонсолей(ТекущаяСтраница.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_ГруппаДанныеКонвертацииXDTOПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаОбработчики" Тогда
		ПослеФормированияКонсолей("ПередКонвертацией");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_СтраницыОбработчикиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ПослеФормированияКонсолей(ТекущаяСтраница.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольДокументСформирован(Элемент)
	
	Расш1_КонсольКодаКлиент.ИнициализироватьКонсоль(ЭтотОбъект, Элемент);
	ПослеФормированияКонсолей();
	Расш1_КонсольКодаКлиент.ВыделитьФразуПоиска(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Расш1_КонсольКодаКлиент.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КомандаКонсоли(Команда)
	
	Если Расш1_КонсольКодаКлиент.ЭтоКомандаНаправления(Команда) Тогда
		ПриИзмененииНаправления(Команда);
	Иначе
		Расш1_КонсольКодаКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Подменю командной панели к этому моменту уже закрыто.
//
&НаКлиенте
Процедура Расш1_Подключаемый_ПоказатьЗакладки()
	
	Расш1_КонсольКодаКлиент.ПоказатьСписокЗакладокСейчас(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНаправления(Команда)
	
	Если Команда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.УстановитьНаправление(ЭтотОбъект, Элементы[Команда.Имя].Заголовок);
	ПослеФормированияКонсолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеФормированияКонсолей(ИмяСтраницы = "")
	
	Если Не КонвертацияXDTO Тогда
		Расш1_ПоказатьКонсольXML(ИмяСтраницы);
		Возврат;
	КонецЕсли;
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя <> "СтраницаКонвертацияXDTO"
		Или Элементы.ГруппаДанныеКонвертацииXDTO.ТекущаяСтраница.Имя <> "СтраницаОбработчики" Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяСтраницы) Тогда
		ИмяСтраницы = Элементы.СтраницыОбработчики.ТекущаяСтраница.Имя;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ПоказатьАлгоритм(ЭтотОбъект, ИмяСтраницы);
	
	Если ИмяСтраницы = "ПередОтложеннымЗаполнением"
		Или ИмяСтраницы = "ПередОбработкойУдаления" Тогда
		Расш1_КонсольКодаКлиент.УстановитьНаправление(
			ЭтотОбъект, Расш1_КонсольКодаКлиентСервер.ПрефиксКомандыПолучение());
	КонецЕсли;
	
	Если ПустаяСтрока(ЭтотОбъект["Направление"]) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеПользовательскихОбъектовJSON = ПолучитьОписаниеПараметровJSON(ЭтотОбъект["Направление"]);
	Расш1_КонсольКодаКлиент.ОбновитьМетаданные(
		ЭтотОбъект,
		Расш1_КонсольКодаКлиентСервер.ИмяЭлементаХостаКонсоли(),
		ОписаниеПользовательскихОбъектовJSON);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_НазначитьКонсольТекущейСтраницы()
	
	Если КонвертацияXDTO
		И Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаКонвертацияXDTO"
		И Элементы.ГруппаДанныеКонвертацииXDTO.ТекущаяСтраница.Имя = "СтраницаОбработчики" Тогда
		ПослеФормированияКонсолей(Элементы.СтраницыОбработчики.ТекущаяСтраница.Имя);
	ИначеЕсли Не КонвертацияXDTO
		И Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаКонвертацияXML" Тогда
		ПослеФормированияКонсолей(Элементы.ОбработчикиXML.ТекущаяСтраница.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_ПоказатьКонсольXML(ИмяСтраницы)
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя <> "СтраницаКонвертацияXML" Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяСтраницы) Тогда
		ИмяСтраницы = Элементы.ОбработчикиXML.ТекущаяСтраница.Имя;
	КонецЕсли;
	
	Расш1_КонсольКодаКлиент.ПоказатьАлгоритм(ЭтотОбъект, ИмяСтраницы);
	Если ПустаяСтрока(ЭтотОбъект["Направление"]) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеПользовательскихОбъектовJSON = Расш1_ОписаниеПараметровСтраницыXML(ЭтотОбъект["Конвертация"], ИмяСтраницы);
	Расш1_КонсольКодаКлиент.ОбновитьМетаданные(
		ЭтотОбъект,
		Расш1_КонсольКодаКлиентСервер.ИмяЭлементаХостаКонсоли(),
		ОписаниеПользовательскихОбъектовJSON);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОписаниеПараметровJSON(Знач Направление)
	
	ПользовательскиеОбъекты = Новый Структура;
	
	КомпонентыОбмена = Расш1_КоллекцияМетаданных.ПолучитьОписаниеКомпонентыОбмена(Направление);
	ПользовательскиеОбъекты.Вставить("КомпонентыОбмена", КомпонентыОбмена);
	
	ОписаниеПользовательскихОбъектов = Новый Структура;
	ОписаниеПользовательскихОбъектов.Вставить("customObjects", ПользовательскиеОбъекты);
	
	ОписаниеПользовательскихОбъектовJSON =
		Расш1_КоллекцияМетаданных.ПолучитьОписаниеМетаданныхJSON(ОписаниеПользовательскихОбъектов);
	
	Возврат ОписаниеПользовательскихОбъектовJSON;
	
КонецФункции

&НаСервере
Процедура Расш1_ЗарегистрироватьАлгоритмСтраницы(ЭлементАлгоритма, ИмяСтраницы, Направление)
	
	Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
	Опции.ИмяСтраницы = ИмяСтраницы;
	Опции.ПоказыватьНаправление = Ложь;
	Опции.АвтоНаправление = Направление;
	Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, ЭлементАлгоритма, Опции);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Расш1_ОписаниеПараметровСтраницыXML(Знач Конвертация, Знач ИмяСтраницы)
	
	Возврат Расш1_КоллекцияМетаданных.ОписаниеПараметровСтраницыJSON(
		Расш1_ИменаПараметровСтраницыXML(ИмяСтраницы), Конвертация, "", "");
	
КонецФункции

&НаСервереБезКонтекста
Функция Расш1_ИменаПараметровСтраницыXML(ИмяСтраницы)
	
	Страницы = Новый Соответствие;
	Страницы.Вставить("ПослеЗагрузкиПравилОбмена", "Параметры");
	Страницы.Вставить("ПередВыгрузкойДанных", "Отказ,Параметры");
	Страницы.Вставить("ПередПолучениемИзмененных", "Параметры,Получатель,УзелДляФоновогоОбмена");
	Страницы.Вставить("ПередВыгрузкойОбъекта",
		"Отказ,Параметры,ИмяПКО,Правило,ВходящиеДанные,ИсходящиеДанные,Объект");
	Страницы.Вставить("ПередОтправкойУдаления", "Ссылка,Отказ");
	Страницы.Вставить("ПередКонвертациейОбъекта",
		"Параметры,Источник,Приемник,ВходящиеДанные,ИсходящиеДанные,ИмяПКО,ПКО,"
		+ "ВыгруженныеОбъекты,Отказ,КлючВыгружаемыхДанных,ЗапоминатьВыгруженные,"
		+ "НеЗапоминатьВыгруженные,НеЗамещатьОбъектПриЗагрузке,НеСоздаватьЕслиНеНайден,"
		+ "ВсеОбъектыВыгружены,ТолькоПолучитьУзелСсылки,РегистрироватьОбъектНаУзлеОтправителе,"
		+ "РежимЗаписи,РежимПроведения");
	Страницы.Вставить("ПослеВыгрузкиОбъекта", "Параметры,Объект,ИмяПКО,ВходящиеДанные,ИсходящиеДанные,УзелСсылки");
	Страницы.Вставить("ПослеВыгрузкиДанных", "Параметры");
	Страницы.Вставить("ПередЗагрузкойДанных", "Отказ,Параметры");
	Страницы.Вставить("ПослеЗагрузкиПараметров", "Отказ,ПричинаОтказа");
	Страницы.Вставить("ПослеПолученияУзловОбмена", "Параметры,УзелОбменаЗагрузкаДанных");
	Страницы.Вставить("ПередЗагрузкойОбъекта",
		"Отказ,Нпп,Источник,ИмяПравила,Правило,ГенерироватьНовыйНомерИлиКодЕслиНеУказан,"
		+ "ТипОбъектаСтрокой,ТипОбъекта,НеЗамещатьОбъект,РежимЗаписи,РежимПроведения");
	Страницы.Вставить("ПриПолученииУдаления", "Объект,Отказ");
	Страницы.Вставить("ПослеЗагрузкиОбъекта",
		"Отказ,Объект,Ссылка,ОбъектНайден,ПараметрыОбъекта,ОбъектМодифицирован,ИмяТипаОбъекта,НаборЗаписей");
	Страницы.Вставить("ПослеЗагрузкиДанных", "Параметры");
	
	Имена = Страницы.Получить(ИмяСтраницы);
	Если Имена = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Имена;
	
КонецФункции

#КонецОбласти
